In [1]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# combine two datasets one from R and other from Marketwatch
df = pd.read_csv("../00_data/sp500_data.csv", parse_dates=["date"])

In [2]:
df.head()

        date       open       high      low      close
0 2015-12-31  2060.5901  2062.5400  2043.62  2043.9399
1 2015-12-30  2077.3401  2077.3401  2061.97  2063.3601
2 2015-12-29  2060.5400  2081.5601  2060.54  2078.3601
3 2015-12-28  2057.7700  2057.7700  2044.20  2056.5000
4 2015-12-24  2063.5200  2067.3601  2058.73  2060.9900

In [4]:
df2 = pd.read_csv("../00_data/sp500_data_2015.csv", parse_dates=["Date"])
df2.head()

        Date  Close/Last     Open     High      Low
0 2023-11-22     4556.62  4553.04  4568.43  4545.05
1 2023-11-21     4538.19  4538.77  4542.14  4525.51
2 2023-11-20     4547.38  4511.70  4557.11  4510.36
3 2023-11-17     4514.02  4509.55  4520.12  4499.66
4 2023-11-16     4508.24  4497.08  4511.99  4487.83

In [5]:
df2.rename(
    columns={
        "Date": "date",
        "Close/Last": "close",
        "Open": "open",
        "High": "high",
        "Low": "low",
    },
    inplace=True,
)
df2.head()

        date    close     open     high      low
0 2023-11-22  4556.62  4553.04  4568.43  4545.05
1 2023-11-21  4538.19  4538.77  4542.14  4525.51
2 2023-11-20  4547.38  4511.70  4557.11  4510.36
3 2023-11-17  4514.02  4509.55  4520.12  4499.66
4 2023-11-16  4508.24  4497.08  4511.99  4487.83

In [7]:
# find last date to merge the data
last_date = df["date"].max()
print(last_date)

2015-12-31 00:00:00

In [8]:
df2_subset = df2[df2["date"] > last_date]
df2_subset.head()

        date    close     open     high      low
0 2023-11-22  4556.62  4553.04  4568.43  4545.05
1 2023-11-21  4538.19  4538.77  4542.14  4525.51
2 2023-11-20  4547.38  4511.70  4557.11  4510.36
3 2023-11-17  4514.02  4509.55  4520.12  4499.66
4 2023-11-16  4508.24  4497.08  4511.99  4487.83

In [9]:
print(df2_subset.shape, df.shape)

(1987, 5) (6553, 5)

In [15]:
merged_df = pd.concat([df, df2_subset], axis=0)
merged_df.head()

        date       open       high      low      close
0 2015-12-31  2060.5901  2062.5400  2043.62  2043.9399
1 2015-12-30  2077.3401  2077.3401  2061.97  2063.3601
2 2015-12-29  2060.5400  2081.5601  2060.54  2078.3601
3 2015-12-28  2057.7700  2057.7700  2044.20  2056.5000
4 2015-12-24  2063.5200  2067.3601  2058.73  2060.9900

In [16]:
merged_df.shape

(8540, 5)

In [17]:
merged_df.to_csv("../00_data/sp500_full.csv", index=False)